УРВ_файловая/src/InformationRegisters/ФактическиеТрудозатраты/ФактическиеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФактическиеТрудозатраты</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Пожелания</types>
      <types>CatalogRef.Консультации</types>
      <types>DocumentRef.Обращение</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.Работы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/CommonModules/УчетВремениКлиент/Module.bsl
#Область ПрограммныйИнтерфейс
    
// Выполняет добавление работы в фактические трудозатраты
//
Процедура ДобавитьВОтчетКлиент(ДатаРаботы, Источник) Экспорт
	
	НуженДиалог = Ложь;
	ПараметрыОповещения = Неопределено;
	
	Длительность = 0;
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ДатаРаботы", ДатаРаботы);
	ПараметрыФормы.Вставить("ОписаниеРаботы", Строка(Источник));
	ПараметрыФормы.Вставить("Длительность", Длительность);
	ПараметрыФормы.Вставить("Источник", Источник);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗавершениеФормыДобавленияРаботы", ЭтотОбъект);
			
	ОткрытьФорму("РегистрСведений.ФактическиеТрудозатраты.Форма.ФормаДобавленияРаботы", ПараметрыФормы,,,,, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЗавершениеФормыДобавленияРаботы(ПараметрыОтчета, Параметры) Экспорт
	
	ПараметрыОповещения = Неопределено;
	
	Если ПараметрыОтчета <> Неопределено Тогда
		УчетВремениВызовСервера.ДобавитьВОтчет(ПараметрыОтчета, ПараметрыОповещения);
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ФактическиеТрудозатраты"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
